dev-helpers/GetParameterValues.cat

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <cwmp:GetParameterValues>
            <ParameterNames SOAP-ENC:arrayType="xsd:string[1]">
                <string>InternetGatewayDevice.DeviceInfo.Manufacturer</string>
            </ParameterNames>
        </cwmp:GetParameterValues>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
